OdDbHandle.bytes(System.Byte*)
\details
Returns this handle object as an array of OdUInt8[8] values.
\param bytes [in] Array of low-ordered bytes to receive the handle.
\remarks
The low order byte is returned in bytes[0].
The buffer must be at least 17 bytes long.

OdDbHandle.op_Addition(System.Int64!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the result of adding a specified value to the value of the OdDbHandle class instance.
\returns Returns the result of adding a value.
\remarks The value of an instance of the OdDbHandle class is not changed.

OdDbHandle.op_AdditionAssignment(System.Int64!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Adds a specified value to the value of this OdDbHandle object.
\returns Returns the updated value of this OdDbHandle class.
\remarks The value of this OdDbHandle class is changed.

OdDbHandle.op_GreaterThanOrEqual(System.UInt64)
\details
Compares the value of an instance of the OdDbHandle class and a specified value.
\param value [in] OdUInt64 value to compare with.
\returns The true value if the value of the OdDbHandle class instance is greater than or equal to the specified value, or false otherwise.

OdDbHandle.op_LessThanOrEqual(System.UInt64)
\details
Compares the value of an instance of the OdDbHandle class and a specified value.
\param value [in] OdUInt64 value to compare with.
\returns The true value if the value of the OdDbHandle class instance is less than or equal to the specified value, or false otherwise.

OdDbHandle.op_LessThan(System.UInt64)
\details
Compares the value of an instance of the OdDbHandle class and a specified value.
\param value [in] OdUInt64 value to compare with.
\returns The true value if the value of the OdDbHandle class instance is smaller than the specified value, or false otherwise.

OdDbHandle.op_GreaterThan(System.UInt64)
\details
Compares the value of an instance of the OdDbHandle class and a specified value.
\param value [in] OdUInt64 value to compare with.
\returns The true value if the value of the OdDbHandle class instance is bigger than the specified value, or false otherwise.

OdDbHandle.op_Inequality(System.UInt64)
\details
Compares the value of an instance of the OdDbHandle class and a specified value.
\param value [in] OdUInt64 value to compare with.
\returns The true value if the value of the OdDbHandle class instance and the specified value are not equal, or false otherwise.

OdDbHandle.op_Equality(System.UInt64)
\details
Compares the value of an instance of the OdDbHandle class and a specified value.
\param value [in] OdUInt64 value to compare with.
\returns The true value if the value of the OdDbHandle class instance and the specified value are equal, or false otherwise.

OdDbHandle.isNull
\details
Returns true and only if this Handle object is null.

OdDbHandle.ascii
\details
Returns the hexidecimal representation of this Handle object as an OdString.

OdDbHandle.getIntoAsciiBuffer(System.UInt16*)
\details
Returns the hexidecimal representation of this Handle object as a null terminated string.
\param pBuf [in]  Pointer to the buffer to receive the string.
\remarks
The buffer must be at least 17 bytes long.

OdDbHandle.op_Assign(System.Int32)
\details
Copy assignment operator. Assigns a new value to this OdDbHandle object, replacing its current contents.
\param value [in] New OdDbHandle value.
\returns Reference to this object.
\details
Assignment operator. Assigns a new int value to this OdDbHandle object, replacing its current contents.
\param value [in] New int value.
\returns Reference to this object.

OdDbHandle.op_Assign(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Assignment operator. Assigns a new char value to this OdDbHandle object, replacing its current contents.
\param value [in] Pointer to a char value.
\returns Reference to this object.

OdDbHandle.op_Assign(System.UInt16!System.Runtime.CompilerServices.IsConst*)
\details
Assignment operator. Assigns a new OdChar value to this OdDbHandle object, replacing its current contents.
\param value [in] Pointer to an OdChar value.
\returns Reference to this object.

OdDbHandle.op_Assign(System.UInt64)
\details
Assignment operator. Assigns a new OdUInt64 value to this OdDbHandle object, replacing its current contents.
\param value [in] New OdUInt64 value.
\returns Reference to this object.

OdDbHandle.#ctor(System.Int32!System.Runtime.CompilerServices.IsLong)
\details
Constructor for a handle using the specified OdInt32 handle value.
\param value [in] OdInt32 value.

OdDbHandle.#ctor(System.Int32)
\details
Constructor for a handle from a specified int value.
\param value [in] An int value.

OdDbHandle.#ctor(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Constructor for a handle from a specified OdAnsiString value.
\param value [in] An OdAnsiString value.

OdDbHandle.#ctor(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Constructor for a handle from a specified OdString value.
\param value [in] An OdString value.

OdDbHandle.#ctor(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Constructor for a handle from a pointer to a char value.
\param value [in] Pointer to an char value.

OdDbHandle.#ctor(System.UInt16!System.Runtime.CompilerServices.IsConst*)
\details
Constructor for a handle from a pointer to an OdChar value.
\param value [in] Pointer to an OdChar value.

OdDbHandle.#ctor(System.UInt64)
\details
Constructor for a handle using the specified 64-bit handle value.
\param value [in] OdUInt64 value.

OdDbHandle.#ctor
\details
Default constructor for instances of the OdDbHandle class.
\remarks
Initializes the handle with the null value.